input_channel: 3

depth_multiple: 1.0
width_multiple: 2.0

backbone:
    # [from, repeat, module, args]
    [
        [-1, 1, Conv, [16, 3, 1]],
        [-1, 1, MaxPool, [2]],
        [-1, 1, Conv, [32, 3, 1]],
        [-1, 1, MaxPool, [2]],
    ]

head:
  # head does not affect by width multiple
  [
    [-1, 1, Conv, [10, 1, 1]],
    [-1, 1, GlobalAvgPool, []],
    [-1, 1, Flatten, []],
  ]
