input_size: [32, 32]
input_channel: 3

depth_multiple: 1.0
width_multiple: 1.0

backbone:
    # [from, repeat, module, args]
    [
        [-1, 1, UpSample, []],
        [-1, 1, PreTrained, [efficientnet_b0, True]],
        [1, 1, PreTrainedFeatureMap, [-3]],
        [-1, 1, Conv, [8, 1], {activation: LeakyReLU}],
        [-1, 1, MaxPool, [2]],

        [1, 1, PreTrainedFeatureMap, [-2]],
        [-1, 1, Conv, [8, 1], {activation: LeakyReLU}],
        [[-1, -3], 1, Concat, []],
        [-1, 1, MaxPool, [2]],

        [1, 1, PreTrainedFeatureMap, [-1]],
        [-1, 1, Conv, [8, 1], {activation: LeakyReLU}],
        [[-1, -3], 1, Concat, []],

        [-1, 1, Flatten, []],
        [-1, 1, Linear, [120, ReLU]],
        [-1, 1, Linear, [84, ReLU]],
    ]

head:
  [
    [-1, 1, Linear, [10]]
  ]

