input_size: [32, 32]
input_channel: 3

depth_multiple: 1.0
width_multiple: 0.5

backbone:
    # [from, repeat, module, args]
    [
        [-1, 1, Identity, []],
        # Conv argument: [out_channel, kernel_size, stride, padding_size]
        # if padding_size is not given or null, the padding_size will be auto adjusted as padding='SAME' in TensorFlow
        [-1, 2, Conv, [16, 3, 1, null], {activation: LeakyReLU}],
        [-1, 1, nn.Conv2d, [32, 3, 1], {padding: 1}],
        # MaxPool argument: [kernel_size, stride, padding_size]
        [-1, 1, MaxPool, [2]],
        [-1, 1, UpSample, []],
        [-1, 1, Conv, [16, 3, 2]],
        [-1, 1, Bottleneck, [32, True], {activation: LeakyReLU}],
        [1, 4, Conv, [16, 3, 2]],
        # Concat argument: [axis]
        [[-1, 5], 1, Concat, [1]],
        [-1, 3, DWConv, [64, 3, 1]],
        [-1, 1, AvgPool, [3, 2, 1]],
        [-1, 1, YamlModule, ["tests/test_configs/inception_module.yaml", 48, 16], {verbose: False}],
        [-1, 1, GlobalAvgPool, []],

        [-1, 1, Flatten, []],
        # Linear argument: [out_channel, activation]
        [-1, 1, Linear, [1024, ReLU]],
        [-1, 1, nn.Linear, [128]],
        [-1, 1, nn.ReLU, []],
        [[-1, 13], 1, Concat, [1]],
        [-1, 1, Flatten, []],

        [-1, 1, Linear, [10, Softmax]]
    ]
