input_size: [32, 32]
input_channel: 3

depth_multiple: 1.0
width_multiple: 0.5

backbone:
    # [from, repeat, module, args]
    [
        [-1, 2, Conv, [64, 3, 1]],
        [-1, 1, MaxPool, [2]],
        [-1, 2, Conv, [128, 3, 1]],
        [-1, 1, MaxPool, [2]],
        [-1, 3, Conv, [256, 3, 1]],
        [-1, 1, MaxPool, [2]],
        [-1, 3, Conv, [512, 3, 1]],
        [-1, 1, MaxPool, [2]],
        [-1, 3, Conv, [512, 3, 1]],
        [-1, 1, MaxPool, [2]],
        [-1, 1, Flatten, []],
        [-1, 1, Linear, [128, ReLU]],
        [-1, 1, Linear, [128, ReLU]],
        [-1, 1, Linear, [10, Softmax]]
    ]
