input_size: [256, 256]
input_channel: 3

depth_multiple: 1.0
width_multiple: 1.0

anchors: &anchors
   - [10,13, 16,30, 33,23]  # P3/8
   - [30,61, 62,45, 59,119]  # P4
   - [116,90, 156,198, 373,326]  # P5/32

n_classes: &n_classes
  10

backbone:
    # [from, repeat, module, args]
    [
        [-1, 1, PreTrained, [efficientnet_b0, True]],
        [0, 1, PreTrainedFeatureMap, [-3]],
        [0, 1, PreTrainedFeatureMap, [-2]],
        [0, 1, PreTrainedFeatureMap, [-1]],
    ]

head:
  [
    [[-3, -2, -1], 1, YOLOHead, [*n_classes, *anchors]]
  ]

